I first applied Old state, then no diff.

New state was entirely new, so tfmigrate was the first thing to initialize the new state locally and remotely.

My actual goal outside of this test case is to move a few modules out of a large monolithic state into a dedicated, new, empty state.

Old State:

```hcl
data "aws_caller_identity" "current" {}

resource "aws_security_group" "foo" {
  name = "foo"
}

resource "aws_security_group" "bar" {
  name = "bar"
}

module "s3-bucket-test" {
  source      = "../../../../modules/s3"
  bucket_name = "gweb-testing-2020-02-12-1304"
  temporary_bucket = true
}
```

New State:

```hcl
data "aws_caller_identity" "current" {}

resource "aws_security_group" "foo" {
  name = "foo"
}

resource "aws_security_group" "bar" {
  name = "bar"
}

module "s3-bucket-test" {
  source      = "../../../../modules/s3"
  bucket_name = "gweb-testing-2020-02-12-1304"
  temporary_bucket = true
}
```

Actual output:

```log
2021/05/08 10:13:37 [INFO] AWS Auth provider used: "SharedCredentialsProvider"
2021/05/08 10:13:38 [INFO] [runner] unapplied migration files: [tfmigrate.hcl]
2021/05/08 10:13:38 [INFO] [runner] load migration file: tfmigrate.hcl
2021/05/08 10:13:38 [INFO] [migrator] multi start state migrator plan
2021/05/08 10:13:38 [INFO] [migrator@.] terraform version: 0.14.10
2021/05/08 10:13:38 [INFO] [migrator@.] initialize work dir
2021/05/08 10:13:42 [INFO] [migrator@.] get the current remote state
2021/05/08 10:13:44 [INFO] [migrator@.] override backend to local
2021/05/08 10:13:44 [INFO] [executor@.] create an override file
2021/05/08 10:13:44 [INFO] [executor@.] switch backend to local
2021/05/08 10:13:46 [INFO] [migrator@../new_state] terraform version: 0.14.10
2021/05/08 10:13:46 [INFO] [migrator@../new_state] initialize work dir
2021/05/08 10:13:54 [INFO] [migrator@../new_state] get the current remote state
2021/05/08 10:13:56 [INFO] [migrator@../new_state] override backend to local
2021/05/08 10:13:56 [INFO] [executor@../new_state] create an override file
2021/05/08 10:13:56 [INFO] [executor@../new_state] switch backend to local
2021/05/08 10:13:58 [INFO] [migrator] compute new states (. => ../new_state)
2021/05/08 10:13:59 [INFO] [migrator@.] check diffs
2021/05/08 10:14:06 [ERROR] [migrator@.] unexpected diffs
2021/05/08 10:14:06 [INFO] [executor@../new_state] remove the override file
2021/05/08 10:14:06 [INFO] [executor@../new_state] switch back to remote
2021/05/08 10:14:20 [INFO] [executor@.] remove the override file
2021/05/08 10:14:20 [INFO] [executor@.] switch back to remote
terraform plan command returns unexpected diffs: failed to run command (exited 2): terraform plan -state=/tmp/tmp539983648 -out=/tmp/tfplan734123519 -input=false -no-color -detailed-exitcode
stdout:

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.bar will be created
  + resource "aws_security_group" "bar" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bar"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.foo will be created
  + resource "aws_security_group" "foo" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "foo"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.s3-bucket-test.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "gweb-testing-2020-02-12-1304"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = "BucketOwner"
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 3
          + enabled                                = true
          + id                                     = "full_bucket_abort_multipart_upload"
        }
      + lifecycle_rule {
          + enabled = false
          + id      = "full_bucket_intelligent_tiering_transition"

          + transition {
              + days          = 7
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = "full_bucket_ttl_bucket_expiration"

          + expiration {
              + days = 1
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # module.s3-bucket-test.aws_s3_bucket_metric.entire_bucket["true"] will be created
  + resource "aws_s3_bucket_metric" "entire_bucket" {
      + bucket = "gweb-testing-2020-02-12-1304"
      + id     = (known after apply)
      + name   = "EntireBucket"
    }

  # module.s3-bucket-test.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3-bucket-test.aws_s3_bucket_policy.policy_basic will be created
  + resource "aws_s3_bucket_policy" "policy_basic" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3-bucket-test.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /tmp/tfplan734123519

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan734123519"


stderr:
```